{"translation-revision-date":"2025-08-10 06:03:24+0000","generator":"GlotPress\/4.0.1","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=2; plural=n > 1;","lang":"pt_BR"},"If you’ve marked up each cell again, remove those extra settings so the table remains clean and predictable.":["Se você tiver marcado cada célula novamente, remova essas configurações adicionais, para que a tabela permaneça limpa e previsível."],"Use your table widget’s header toggle for the first row instead of manually tagging each header cell.":["Use o botão de alternância do cabeçalho do seu widget de tabela para a primeira linha, em vez de marcar manualmente cada célula do cabeçalho."],"A table header cell (<th>) is manually given a different role, making it confusing for screen readers to understand the table structure.":["Uma célula de cabeçalho de tabela (<th>) recebe manualmente uma função diferente, o que dificulta a compreensão da estrutura da tabela pelos leitores de tela."],"When you add a table or grid, don’t layer extra labels or roles onto each row or cell. Use the table block’s built-in settings.":["Ao adicionar uma tabela ou grade, não coloque rótulos ou funções adicionais em cada linha ou célula. Use as configurações internas do bloco da tabela."],"If table elements have their natural roles changed, assistive technologies may misread the table, making it harder for people to understand the data":["Se os elementos da tabela tiverem suas funções naturais alteradas, as tecnologias assistivas podem fazer uma leitura incorreta da tabela, dificultando a compreensão dos dados pelas pessoas"],"Don’t override the natural roles of table elements":["Não substitua as funções naturais dos elementos da tabela"],"Misused Table Roles":["Funções de tabela mal usadas"],"For grouped icons or buttons, use a list container so each icon is treated as one item.":["Para ícones ou botões agrupados, use um contêiner de lista, para que cada ícone seja tratado como um item."],"In a bullet list of features, ensure each feature is a list item—don’t mix in headings or plain text blocks.":["Em uma lista com marcadores de recursos, certifique-se de que cada recurso seja um item da lista, não misture títulos ou blocos de texto simples."],"A list groups together elements that aren’t proper list items, confusing screen readers.":["Uma lista agrupa elementos que não são itens de lista adequados, confundindo os leitores de tela."],"Make sure every item in a list or grouped set is a true list item so screen readers announce them in order.":["Certifique-se de que cada item de uma lista ou conjunto agrupado seja um item de lista verdadeiro, para que os leitores de tela os anunciem em ordem."],"If lists are not built with the right items, assistive technologies can misread the structure, making it harder for people to understand the content.":["Se as listas não forem criadas com os itens corretos, as tecnologias assistivas podem interpretar incorretamente a estrutura, dificultando a compreensão do conteúdo."],"Lists must only contain list items.":["As listas podem conter apenas itens de lista."],"Invalid List Items":["Itens da lista inválidos"],"For a tutorial video, use “How-To Tutorial Video.”":["Para um vídeo tutorial, use “Vídeo tutorial explicativo”."],"For a project file embed, set its title to “Project Files Preview.”":["Para incorporar um arquivo de projeto, defina seu título como “Pré-visualização dos arquivos do projeto”."],"An embedded video has no title, making it unclear to screen reader users what the embedded content is about.":["Um vídeo incorporado não tem título, o que torna difícil para os usuários de leitores de tela saberem do que se trata o conteúdo incorporado."],"Give each embedded frame (like videos or file previews) a short title so everyone knows what’s inside.":["Dê a cada quadro incorporado (como vídeos ou pré-visualizações de arquivos) um título curto, para que todos saibam o que há dentro."],"If embedded content doesn’t have a descriptive title, people relying on assistive technologies may not know what the content is or whether they want to interact with it.":["Se o conteúdo incorporado não tiver um título descritivo, as pessoas que dependem de tecnologias assistivas podem não saber qual é o conteúdo ou se querem interagir com ele."],"Embedded content (iframes) must have a clear, unique title.":["O conteúdo incorporado (iframes) precisa ter um título claro e único."],"Missing Iframe Title":["Título do Iframe ausente"],"If the design template “hides” the title area completely, switch to (or edit) a template that includes a title field, then add a descriptive phrase like “Organic Dog Treats – Home.”":["Se o modelo de design “ocultar” completamente a área do título, mude para (ou edite) um modelo que inclua um campo de título e, em seguida, adicione uma frase descritiva como “Petiscos orgânicos para cães – Página inicial”."],"If the title shows “Untitled Page,” replace it with something specific like “Contact Us – Email & Location.”":["Se o título mostrar “Página sem título”, substitua por algo específico, como “Fale conosco – E-mail e localização”."],"If the title box in your page or SEO settings is blank, type a short description such as “About Our Clinic.”":["Se o campo do título na sua página ou nas configurações de SEO estiver em branco, digite uma breve descrição, como “Sobre nossa clínica”."],"A page title just says \"Home\" even though it’s a product page, making it unclear to users and screen readers what the page is about.":["O título da página diz apenas “Página inicial”, mesmo sendo uma página de produto, o que torna pouco claro para os usuários e leitores de tela o conteúdo da página."],"Make sure every page actually has a title ⎯ and that the title tells visitors what’s on the page.":["Certifique-se de que cada página tenha um título e que ele informe aos visitantes o que há na página."],"If the page title doesn’t describe the content clearly, people may have trouble understanding where they are, especially when using tabs, bookmarks, or screen readers.":["Se o título da página não descrever claramente o conteúdo, as pessoas podem ter dificuldade em entender onde estão, especialmente ao usar abas, favoritos ou leitores de tela."],"Each page must have a clear, descriptive title.":["Cada página precisa ter um título claro e descritivo."],"Missing Page Title":["Título da página ausente"],"Ensure that pressing Tab brings that link into view before the navigation menu.":["Certifique-se de que, ao pressionar a tecla “Tab”, o link seja visualizado antes do menu de navegação."],"Include a hidden link at the top labeled “Skip to main content” that appears when focused.":["Inclua um link oculto na parte superior com o título “Acessar o conteúdo principal” que aparece quando focado."],"A user has to tab through the entire navigation menu every time they visit a new page because there’s no shortcut to jump to the main content.":["O usuário precisa percorrer todo o menu de navegação com a tecla “Tab” cada vez que acessa uma nova página, pois não há um atalho para acessar o conteúdo principal."],"Add a “Skip to main content” link as the first focusable item so keyboard users can jump straight to your page’s main area.":["Adicione um link “Acessar o conteúdo principal” como o primeiro item selecionável, para que os usuários de teclado possam acessar diretamente a área principal da sua página."],"If people can't easily skip to the main content, especially keyboard and screen reader users, navigating the site becomes slow, frustrating, and tiring.":["Se as pessoas não conseguem acessar facilmente o conteúdo principal, especialmente os usuários de teclado e leitores de tela, a navegação no site se torna lenta, frustrante e cansativa."],"Pages must let users skip straight to the main content.":["As páginas precisam permitir que os usuários acessem diretamente o conteúdo principal."],"Missing Skip Link":["Link de ignorar ausente"],"Name a layout toolbar “Page Layout Controls.”":["Dê um nome à barra de ferramentas do layout, como “Controles de layout da página”."],"Call your formatting toolbar “Text Formatting Tools.”":["Chame sua barra de ferramentas de formatação de “Ferramentas de formatação de texto”."],"A page has multiple toolbars, but they are all labeled \"Toolbar,\" making it difficult for screen reader users to know what each one controls.":["Uma página tem várias barras de ferramentas, mas todas elas são rotuladas como “Barra de ferramentas”, o que dificulta aos usuários de leitores de tela saber o que cada uma controla."],"Give every toolbar or set of tools a clear name so users know what controls they’re grouped in.":["Dê a cada barra de ferramentas ou conjunto de ferramentas um nome claro, para que os usuários saibam em quais controles estão agrupados."],"If toolbars don’t have unique labels, people relying on assistive technologies may get confused about which toolbar to use, leading to mistakes and frustration.":["Se as barras de ferramentas não tiverem rótulos únicos, as pessoas que dependem de tecnologias assistivas podem ficar confusas sobre qual barra de ferramentas usar, levando a erros e frustração."],"Toolbars must have a clear, unique label.":["As barras de ferramentas precisam ter um rótulo claro e único."],"If your theme forces a generic “Search,” add hidden text “Search Site” to distinguish it.":["Se o seu tema forçar um “Pesquisar” genérico, adicione o texto oculto “Pesquisar no site” para diferenciá-lo."],"Label one search box “Search Products” and another “Search Blog Posts.”":["Rotule uma caixa de pesquisa como “Pesquisar produtos” e outra como “Pesquisar posts do blog”"],"A page has two search bars, but both are labeled \"Search,\" making it hard for screen reader users to know which search feature they are using.":["Uma página tem duas barras de pesquisa, mas ambas são rotuladas como “Pesquisar”, o que dificulta que os usuários de leitores de tela saibam qual recurso de pesquisa estão usando."],"Give each search input its own label so people know what they’re searching.":["Dê a cada campo de pesquisa seu próprio rótulo, para que as pessoas saibam o que estão pesquisando."],"If search areas don’t have unique labels, people relying on assistive technologies may get confused and struggle to find the right search tool.":["Se as áreas de pesquisa não tiverem rótulos exclusivos, as pessoas que dependem de tecnologias assistivas podem ficar confusas e ter dificuldade para encontrar a ferramenta de pesquisa correta."],"Search areas must have a clear, unique label.":["As áreas de pesquisa precisam ter um rótulo claro e único."],"Duplicate Search Labels":["Rótulos de pesquisa duplicados"],"Duplicate Toolbar Labels":["Rótulos da barra de ferramentas duplicados"],"If there’s no visible heading, give the panel a hidden label like “Real-Time Log Panel.”":["Se não houver um título visível, dê ao painel um rótulo oculto, como “Painel de registro em tempo real”."],"Add a heading “Real-Time Log” above a log panel and connect the panel to that heading.":["Adicione um título “Registro em tempo real” acima de um painel de registro e conecte o painel a esse título."],"A section with additional information is not labeled, making it unclear for screen reader users what the section is about.":["Uma seção com informações adicionais não está rotulada, o que não deixa claro aos usuários de leitores de tela do que se trata a seção."],"Tie each section to its visible heading or add a hidden name so screen readers announce it correctly.":["Associe cada seção ao seu título visível, ou adicione um nome oculto, para que os leitores de tela a anunciem corretamente."],"If content sections aren’t labeled, people relying on assistive technologies may not understand the purpose of different parts of the page, making navigation harder.":["Se as seções de conteúdo não estiverem rotuladas, as pessoas que dependem de tecnologias assistivas podem não entender a finalidade das diferentes partes da página, dificultando a navegação."],"Content sections must have a clear label.":["As seções de conteúdo precisam ter um rótulo claro."],"Unlabeled Content Region":["Região de conteúdo sem rótulo"],"If you have two help boxes, name one “FAQ Help” and the other “Live Support Info.”":["Se você tiver duas caixas de ajuda, nomeie uma como “Ajuda das perguntas frequentes” e a outra como “Informações de suporte ao vivo”."],"Two regions on a page are both labeled \"Section,\" making it difficult for screen reader users to understand the difference between them.":["Duas regiões em uma página estão rotuladas como “Seção”, o que torna difícil para os usuários de leitores de tela entenderem a diferença entre elas."],"Give each section or “region” (like a news box or sidebar) its own name so users know what it contains.":["Dê a cada seção ou “região” (como uma caixa de notícias ou barra lateral) seu próprio nome, para que os usuários saibam o que ela contém."],"If content sections don’t have unique labels, people relying on assistive technologies may get confused about the layout and miss important information.":["Se as seções de conteúdo não tiverem rótulos exclusivos, as pessoas que dependem de tecnologias assistivas podem ficar confusas com o layout e perder informações importantes."],"Content sections (regions) must have a clear, unique label.":["As seções de conteúdo (regiões) precisam ter um rótulo claro e único."],"Duplicate Region Labels":["Rótulos de região duplicados"],"Label a footer menu “Footer Links.”":["Rotule o menu de rodapé como “Links do rodapé”."],"Label your top menu “Primary Navigation.”":["Rotule seu menu superior como “Navegação principal”."],"A page has two navigation sections, both labeled \"Navigation,\" making it hard for screen reader users to know which menu they are using.":["Uma página tem duas seções de navegação, ambas rotuladas como “Navegação”, o que dificulta que os usuários de leitores de tela saibam qual menu estão usando."],"Give every navigation menu (header, sidebar, footer) its own label so users know which menu they’re in.":["Dê a cada menu de navegação (cabeçalho, barra lateral, rodapé) seu próprio rótulo, para que os usuários saibam em qual menu estão."],"If navigation menus don’t have unique labels, people relying on assistive technologies may get confused and struggle to move around the site.":["Se os menus de navegação não tiverem rótulos exclusivos, as pessoas que dependem de tecnologias assistivas podem ficar confusas e ter dificuldade para navegar pelo site."],"Navigation menus must have a clear, unique label.":["Os menus de navegação precisam ter um rótulo claro e único."],"Duplicate Navigation Labels":["Rótulos de navegação duplicados"],"If you show search results in a separate main-style panel, label it “Search Results Panel” rather than marking it as another main region.":["Se você mostrar os resultados da pesquisa em um painel separado no estilo principal, rotule-o como “Painel de resultados da pesquisa” em vez de marcá-lo como outra região principal."],"Ensure only your primary content block is set as “Main.”":["Garanta que apenas seu bloco de conteúdo principal esteja definido como “Principal”."],"A page has two main sections, both labeled \"Main Content,\" making it confusing for screen reader users to know which section they are in.":["Uma página tem duas seções principais, ambas rotuladas como “Conteúdo principal”, o que confunde os usuários de leitores de tela que precisam saber em qual seção estão."],"Identify one area as your page’s main content; if you need additional main-like sections, give each a unique label instead of multiple “Main” roles.":["Identifique uma área como o conteúdo principal da sua página. Se você precisar de outras seções semelhantes às principais, dê a cada uma delas um rótulo exclusivo em vez de várias funções “Principal”."],"If main sections don’t have unique labels, people relying on assistive technologies may get lost or misunderstand the structure of the page.":["Se as seções principais não tiverem rótulos exclusivos, as pessoas que dependem de tecnologias assistivas podem se perder ou não entender a estrutura da página."],"Main sections must have a clear, unique label.":["As seções principais precisam ter um rótulo claro e único."],"Duplicate Main Content Labels":["Rótulos de conteúdo principal duplicados"],"For two menus, label one “Main Navigation” and the other “Footer Menu.”":["Para dois menus, rotule um como “Navegação principal” e o outro como “Menu do rodapé”."],"Rename one sidebar “Related Articles” and the other “Recommended Products.”":["Renomeie uma barra lateral para “Artigos relacionados” e a outra para “Produtos recomendados”."],"Two navigation sections are both labeled \"Main Menu,\" making it hard for screen reader users to tell them apart.":["Duas seções de navegação estão rotuladas como “Menu principal”, o que dificulta que os usuários de leitores de tela as diferenciem."],"If you have more than one section of the same kind (like two sidebars), give each a different label so users know which is which.":["Se você tiver mais de uma seção do mesmo tipo (como duas barras laterais), dê a cada uma um rótulo diferente, para que os usuários saibam qual é qual."],"Landmark sections must have a unique label or be clearly separated.":["As seções de referência precisam ter um rótulo exclusivo ou estar claramente separadas."],"Duplicate Landmark Labels":["Rótulos de referência duplicados"],"If landmarks aren’t uniquely labeled or clearly separated, people relying on assistive technologies can get confused about the page layout, making navigation harder.":["Se as áreas de referência não estiverem rotuladas de forma exclusiva ou claramente separadas, as pessoas que dependem de tecnologias assistivas podem se confundir com o layout da página, dificultando a navegação."],"Enclose each major section of your page in the right landmark region so assistive tools know what each part is for.":["Coloque cada seção principal da sua página na área de referência correta, para que as ferramentas de assistência saibam para que serve cada parte."],"If content isn’t placed inside clear landmarks, people relying on assistive technologies may struggle to navigate and understand the structure of the page.":["Se o conteúdo não for colocado dentro de áreas de referência claras, as pessoas que dependem de tecnologias assistivas podem ter dificuldade para navegar e entender a estrutura da página."],"All content must be placed inside clear sections (landmarks).":["Todo o conteúdo precisa ser colocado dentro de seções claras (áreas de referência)."],"Content Outside Landmarks":["Conteúdo fora das áreas de referência"],"A separate survey form is labeled “Customer Feedback Survey.”":["Um formulário de pesquisa separado está rotulado como “Pesquisa de feedback do cliente”."],"Label your contact form “Contact Us Form” in the form settings.":["Rotule seu formulário de contato como “Formulário de contato” nas configurações do formulário."],"A page has two different forms, but both are labeled \"Form,\" making it hard for screen reader users to know which form they are filling out.":["Uma página tem dois formulários diferentes, mas ambos estão rotulados como “Formulário”, o que dificulta que os usuários de leitores de tela saibam qual formulário estão preenchendo."],"Give each form on the page a short, unique name (for example, “Contact Form” or “Newsletter Signup”) so assistive tools can tell them apart.":["Dê a cada formulário da página um nome curto e exclusivo (por exemplo, “Formulário de contato” ou “Assinatura do boletim informativo”) para que as ferramentas de assistência possam diferenciá-los."],"If forms don’t have unique labels, people relying on assistive technologies may get confused about what each form is for, leading to mistakes and frustration.":["Se os formulários não tiverem rótulos exclusivos, as pessoas que dependem de tecnologias assistivas podem ficar confusas quanto à finalidade de cada formulário, o que leva a erros e frustrações."],"Forms must have a clear, unique label.":["Os formulários precisam ter um rótulo claro e único."],"A downloadable report section gets a hidden label “Monthly Sales Report” if no visible heading fits.":["Uma seção de relatório para baixar recebe um rótulo oculto “Relatório de vendas mensal” se nenhum título visível se encaixar."],"A news feed panel is labeled “Breaking News Feed” so screen readers announce it.":["Um painel de feed de notícias está rotulado como “Feed de notícias de última hora” para que os leitores de tela o anunciem."],"Two embedded documents on a page are both labeled \"Document,\" making it difficult for screen reader users to tell them apart.":["Dois documentos incorporados em uma página estão ambos rotulados como “Documento”, o que dificulta que os usuários de leitores de tela os diferenciem."],"For any special document-like widget or panel, give it its own visible or hidden title so users understand its purpose.":["Para qualquer widget ou painel semelhante a um documento específico, dê a ele seu próprio título visível ou oculto, para que os usuários entendam sua finalidade."],"If documents don’t have unique labels, people relying on assistive technologies may not understand the difference between them, leading to confusion and frustration.":["Se os documentos não tiverem rótulos exclusivos, as pessoas que dependem de tecnologias assistivas podem não entender a diferença entre eles, causando confusão e frustração."],"Documents must have a clear, unique label.":["Os documentos precisam ter um rótulo claro e único."],"Duplicate Document Labels":["Rótulos de documentos duplicados"],"A copyright widget had a footer setting—remove that so only the main footer block is treated as contentinfo.":["Um widget de direitos autorais tinha uma configuração de rodapé, remova-a para que apenas o bloco principal do rodapé seja tratado como contentinfo."],"If both your top bar and bottom bar were set as footers, turn off the footer label on the top bar so only the true footer remains.":["Se a barra superior e a barra inferior estiverem definidas como rodapés, desative o rótulo do rodapé na barra superior, para que apenas o rodapé verdadeiro permaneça."],"A page has two footers, making it confusing for screen reader users to understand where the main site information ends.":["Uma página tem dois rodapés, o que confunde os usuários de leitores de tela que não conseguem entender onde terminam as principais informações do site."],"Keep only one section marked as the page’s footer and remove any extra footer roles from secondary sections.":["Mantenha apenas uma seção marcada como rodapé da página, e remova todas as funções adicionais do rodapé das seções secundárias."],"If there’s more than one footer, people relying on assistive technologies may get confused about the page structure, making navigation harder and less predictable.":["Se houver mais de um rodapé, as pessoas que dependem de tecnologias assistivas podem se confundir com a estrutura da página, tornando a navegação mais difícil e menos previsível."],"Each page should have only one footer section.":["Cada página deve ter apenas uma seção de rodapé."],"Multiple Footers Present":["Vários rodapés presentes"],"If you have a legal notice and a separate copyright block, label only the main footer section and leave the rest unlabeled.":["Se você tiver uma notificação legal e um bloco de direitos autorais separado, rotule apenas a seção principal do rodapé e deixe o restante sem rótulo."],"In your footer settings, add the hidden label “Site Footer” so assistive tools recognize it.":["Nas configurações do rodapé, adicione o rótulo oculto “Rodapé do site” para que as ferramentas de assistência o reconheçam."],"Two footers on a page are both labeled \"Footer,\" making it hard for screen reader users to know which one contains which information.":["Dois rodapés em uma página são ambos rotulados como “Rodapé”, o que dificulta que os usuários de leitores de tela saibam qual deles contém quais informações."],"Give your footer area a unique name (like “Site Footer”) so screen readers announce it as the page’s footer.":["Dê à sua área de rodapé um nome único (como “Rodapé do site”) para que os leitores de tela a anunciem como o rodapé da página."],"If footer sections don’t have unique labels, people relying on assistive technologies may get confused about the different types of information available at the bottom of the page.":["Se as seções de rodapé não tiverem rótulos exclusivos, as pessoas que dependem de tecnologias assistivas poderão ficar confusas quanto aos diferentes tipos de informações disponíveis na parte inferior da página."],"Footer sections must have a clear, unique label.":["As seções de rodapé precisam ter um rótulo claro e único."],"Duplicate Footer Labels":["Rótulos de rodapé duplicados"],"Sidebar or related links: Place widgets like “Related Articles” or “Contact Info” inside a Sidebar or a “Complementary” region.":["Barra lateral ou links relacionados: Coloque widgets como “Artigos relacionados” ou “Informações de contato” em uma barra lateral ou em uma região “Complementar”."],"Footer: Use your theme’s Footer area (or add a “Footer” block) so it’s recognized as the page’s footer.":["Rodapé: Use a área de rodapé do seu tema (ou adicione um bloco “Rodapé”) para que ele seja reconhecido como o rodapé da página."],"Main content: Put your primary article or page text inside a “Main Content” block or section so it’s announced as the main section.":["Conteúdo principal: Coloque o texto do seu artigo ou página principal dentro de um bloco ou seção “Conteúdo principal” para que ele seja anunciado como a seção principal."],"A page has important content floating outside of main sections like “Main,” “Navigation,” or “Footer,” making it harder for screen reader users to find.":["Uma página tem conteúdo importante flutuando fora das seções principais, como “Principal”, “Navegação” ou “Rodapé”, o que dificulta sua localização pelos usuários de leitores de tela."],"If no heading fits, give the section a hidden label like “Help & Support Panel.”":["Se nenhum título se encaixar, dê à seção um rótulo oculto, como “Painel de ajuda e suporte”."],"Above a “Recent Posts” sidebar, add the heading “Recent Posts” and connect the section to it so screen readers say “Recent Posts, section.”":["Acima da barra lateral “Posts recentes”, adicione o título “Posts recentes” e conecte a seção a ele para que os leitores de tela digam “Posts recentes, seção”."],"A sidebar with extra information isn’t labeled, so screen reader users don’t know what the section is about.":["A barra lateral com informações adicionais não está rotulada, então os usuários de leitores de tela não sabem do que se trata a seção."],"Link each complementary section (sidebar, help panel) to its visible heading or add a hidden label so it’s announced properly.":["Vincule cada seção complementar (barra lateral, painel de ajuda) ao seu título visível ou adicione um rótulo oculto, para que seja anunciado corretamente."],"If side content isn’t labeled, people relying on assistive technologies may miss important information or not understand the purpose of different sections.":["Se o conteúdo lateral não for rotulado, as pessoas que dependem de tecnologias assistivas podem perder informações importantes ou não entender a finalidade das diferentes seções."],"Side content areas must have a clear label.":["As áreas de conteúdo lateral precisam ter um rótulo claro."],"Sidebar Missing Label":["Rótulo ausente na barra lateral"],"A contact info box is named “Office Hours & Contacts.”":["Uma caixa de informações de contato é chamada “Horário de atendimento e contatos”."],"A news sidebar is labeled “Related Articles” so it’s announced as such.":["A barra lateral de notícias está rotulada como “Artigos relacionados”, por isso é anunciada desta forma."],"Two sidebars are both labeled \"Related Information,\" making it hard for screen reader users to tell them apart.":["Duas barras laterais são ambas rotuladas como “Informações relacionadas”, o que dificulta que os usuários de leitores de tela as diferenciem."],"Give each sidebar or related-content region its own unique label so users understand its purpose.":["Dê a cada barra lateral ou região de conteúdo relacionado seu próprio rótulo exclusivo, para que os usuários entendam sua finalidade."],"If side sections don’t have unique labels, people relying on assistive technologies may not understand the difference between them, leading to confusion when navigating the page.":["Se as seções laterais não tiverem rótulos exclusivos, as pessoas que dependem de tecnologias assistivas podem não entender a diferença entre elas, causando confusão ao navegar pela página."],"Side content areas must have a clear, unique label.":["As áreas de conteúdo lateral precisam ter um rótulo claro e único."],"Duplicate Sidebar Labels":["Rótulos da barra lateral duplicados"],"If both your logo area and top navigation were marked as banners, turn off the banner setting on the navigation so only the logo area remains the one true banner.":["Se ambas as áreas do logo e da navegação superior estiverem marcadas como banners, desative a configuração de banner na navegação, para que apenas a área do logo permaneça como o único banner verdadeiro."],"A website includes two banners at the top, confusing screen reader users about where the main site information starts.":["Um site inclui dois banners na parte superior, o que confunde os usuários de leitores de tela sobre onde começam as informações principais do site."],"Only one element on the page should act as the main banner. Remove banner labels from any extra headers.":["Apenas um elemento na página deve funcionar como banner principal. Remova os rótulos de banner de todos os cabeçalhos adicionais."],"If there’s more than one banner, people relying on assistive technologies may get confused about the structure of the page, making navigation harder.":["Se houver mais de um banner, as pessoas que dependem de tecnologias assistivas podem se confundir com a estrutura da página, dificultando a navegação."],"Each page should have only one banner.":["Cada página precisa ter apenas um banner."],"Multiple Banners Used":["Vários banners usados"],"If you have two headers, remove the extra label from the secondary one and keep only the primary banner named “Main Page Header.”":["Se você tiver dois cabeçalhos, remova o rótulo adicional do secundário e mantenha apenas o banner principal chamado “Cabeçalho principal da página”."],"Label your weather updates panel “Weather Forecast” and your stock ticker panel “Market Updates.”":["Rotule seu painel de atualizações meteorológicas como “Previsão do tempo”, e seu painel de cotação de ações como “Atualizações do mercado”."],"Label the top header region “Pelican Claims Site Header” so screen readers recognize it as the main banner.":["Rotule a região superior do cabeçalho como “Cabeçalho do site Pelican Claims”, para que os leitores de tela a reconheçam como o banner principal."],"Two banners on a page are both labeled \"Site Banner,\" making it difficult for screen reader users to know which banner provides which information.":["Dois banners em uma página estão ambos rotulados como “Banner do site”, o que dificulta que os usuários de leitores de tela saibam qual banner fornece qual informação."],"Give your main page header (the banner) a unique name describing your site or section.":["Dê ao cabeçalho principal da página (o banner) um nome único que descreva o site ou a seção."],"If banners don’t have unique labels, people relying on assistive technologies may get confused about the purpose of each section, leading to a frustrating experience.":["Se os banners não tiverem rótulos exclusivos, as pessoas que dependem de tecnologias assistivas podem ficar confusas quanto à finalidade de cada seção, o que leva a uma experiência frustrante."],"Banners must have a clear, unique label.":["Os banners precisam ter um rótulo claro e único."],"Duplicate Banner Labels":["Rótulos de banner duplicados"],"A guest post section is labeled \"Guest Insights: UX Trends\" so assistive tech announces the correct article heading.":["Uma seção de posts de visitantes está rotulada como \"Informações dos visitantes: Tendências de experiência do usuário\" para que a tecnologia assistiva anuncie o título correto do artigo."],"A feature story gets the title \"How to Improve Site Accessibility\" in its hidden or visible label.":["Uma matéria especial recebe o título “Como melhorar a acessibilidade do site” no seu rótulo oculto ou visível."],"Two articles on a news site are both labeled \"Story,\" making it hard for screen reader users to tell them apart.":["Dois artigos em um site de notícias estão ambos rotulados como “Matéria”, o que dificulta que os usuários de leitores de tela os diferenciem."],"Make sure every article or blog post section has its own clear title so users know what it contains.":["Certifique-se de que cada artigo ou seção de post do blog tenha seu próprio título claro, para que os usuários saibam o que ele contém."],"If articles don’t have unique labels, people relying on assistive technologies may get confused about the content or skip important information.":["Se os artigos não tiverem rótulos exclusivos, as pessoas que dependem de tecnologias assistivas podem se confundir com o conteúdo ou ignorar informações importantes."],"Articles must have a clear, unique label.":["Os artigos precisam ter um rótulo claro e único."],"Duplicate Article Labels":["Rótulos de artigos duplicados"],"If there’s no visible heading, give the panel a hidden label like “Search Widget” for clarity.":["Se não houver um título visível, dê ao painel um rótulo oculto, como “Widget de pesquisa”, para maior clareza."],"Above a “News” widget, add the heading “Top Stories” and connect the panel to that heading so screen readers say “Top Stories, panel.”":["Acima do widget “Notícias”, adicione o título “Principais matérias” e conecte o painel a esse título para que os leitores de tela digam “Principais matérias, painel”."],"An app-like section is created but doesn’t have a label, leaving screen reader users unsure what the section is for.":["Uma seção semelhante a um aplicativo foi criada, mas não tem um rótulo, o que deixa os usuários de leitores de tela sem saber para que serve a seção."],"Link each application-style panel to visible heading text or add a hidden label so it’s announced correctly.":["Vincule cada painel de estilo de aplicativo ao texto do título visível ou adicione um rótulo oculto, para que ele seja anunciado corretamente."],"If interactive areas don’t have a clear label, people relying on assistive technologies may struggle to understand and use the content correctly.":["Se as áreas interativas não tiverem um rótulo claro, as pessoas que dependem de tecnologias assistivas podem ter dificuldade para entender e usar o conteúdo corretamente."],"Interactive areas must have a clear label describing their purpose.":["As áreas interativas precisam ter um rótulo claro que descreva sua finalidade."],"Missing Interactive Label":["Rótulo interativo ausente"],"A stock-ticker area is labeled “Stock Ticker Feed” (even if the label isn’t visible) to describe its purpose.":["Uma área de cotação de ações está rotulada como “Feed de cotação de ações” (mesmo que o rótulo não esteja visível) para descrever sua finalidade."],"A weather box gets the hidden name “Weather Forecast Panel” so assistive tools announce it.":["Uma caixa de previsão do tempo recebe o nome oculto “Painel de previsão do tempo”, para que as ferramentas de assistência a anunciem."],"Two app sections on a page are both labeled \"Main Area,\" making it confusing for screen reader users to tell them apart.":["Duas seções de aplicativos em uma página estão ambas rotuladas como “Área principal”, o que dificulta que os usuários de leitores de tela as diferenciem."],"Give each interactive “app-style” region (like a widget panel) a unique name so screen readers know what it is.":["Dê a cada região interativa “estilo aplicativo” (como um painel de widget) um nome exclusivo para que os leitores de tela saibam o que é."],"If interactive areas don’t have unique labels, people relying on assistive technologies may not know what each area is for, making navigation confusing and frustrating.":["Se as áreas interativas não tiverem rótulos exclusivos, as pessoas que dependem de tecnologias assistivas podem não saber para que serve cada área, o que torna a navegação confusa e frustrante."],"Interactive areas must have a clear, unique label.":["As áreas interativas precisam ter um rótulo claro e único."],"Duplicate Interactive Labels":["Rótulos interativos duplicados"],"If you have both English and another language, use the Auto setting so the browser figures it out.":["Se você tiver inglês e outro idioma, use a configuração “Automático” para que o navegador os identifique."],"For a section in Arabic, switch its direction to Right-to-Left (RTL) so the text reads naturally.":["Para uma seção em árabe, altere sua direção para “da direita para esquerda (RTL)”, para que o texto seja lido naturalmente."],"In your site or theme settings, choose Left-to-Right (LTR) if your content is in English or most European languages.":["Nas configurações do seu site ou tema, escolha “da esquerda para a direita (LTR)” se o seu conteúdo estiver em inglês ou na maioria dos idiomas europeus."],"A page sets the text direction using an invalid value, making it harder for assistive technologies to display the content correctly.":["Uma página define a direção do texto usando um valor inválido, o que dificulta a exibição correta do conteúdo pelas tecnologias de assistência."],"Set the text direction to match the language left-to-right for English, right-to-left for Hebrew\/Arabic, or automatic if you’re mixing languages.":["Defina a direção do texto para corresponder ao idioma da esquerda para a direita para o inglês, da direita para a esquerda para o hebraico\/árabe ou automático se houver mistura de idiomas."],"If the text direction isn’t set properly, people may have trouble reading the content, especially in languages that flow right-to-left, like Arabic or Hebrew.":["Se a direção do texto não estiver definida corretamente, as pessoas podem ter problemas para ler o conteúdo, especialmente em idiomas que fluem da direita para a esquerda, como o árabe ou o hebraico."],"Text direction settings must use a valid value.":["As configurações da direção do texto precisam usar um valor válido."],"Invalid Text Direction":["Direção de texto inválida"],"A “testimonial” layout that used <th> and <caption> is rebuilt with cards or panels, with no table elements at all.":["Um layout de “depoimentos” que usava <th> e <caption> foi reconstruído com cartões ou painéis, sem nenhum elemento de tabela."],"A page section arranged in columns switches from a layout table to a responsive grid layout.":["Uma seção de página organizada em colunas muda de uma tabela de layout, para um layout em grade responsivo."],"A layout table is marked with a role that hides it from assistive technologies, but it still includes headers, causing confusion for screen reader users.":["Uma tabela de layout está marcada com uma função que a oculta das tecnologias assistivas, mas ainda inclui cabeçalhos, o que causa confusão para os usuários de leitores de tela."],"Don’t use table markup for page layout if it’s decorative or structural, rebuild with layout blocks and remove captions, header tags, and other table-only features.":["Não use marcação de tabela para o layout da página, se ela for decorativa ou estrutural. Recrie com blocos de layout e remova legendas, tags de cabeçalho e outros recursos somente de tabela."],"If a table meant just for layout has headers or structure, assistive technologies may misinterpret it as a data table, leading to a confusing experience.":["Se uma tabela destinada apenas para layout tiver cabeçalhos ou estrutura, as tecnologias assistivas podem interpretá-la incorretamente como uma tabela de dados, o que gera uma experiência confusa."],"Tables used only for layout should not have headers or structure.":["As tabelas usadas apenas para layout, não podem ter cabeçalhos ou estrutura."],"Layout Table Misuse":["Uso indevido da tabela de layout"],"A financial report table assigns each number cell to “Q1,” “Q2,” etc., and to “Expenses” or “Revenue” as appropriate.":["Uma tabela de relatório financeiro atribui cada célula numérica a “T1”, “T2” etc. e a “Despesas” ou “Receita”, conforme apropriado."],"In a schedule grid, meeting times are linked to both “Monday” and “Conference Room A” so assistive tech reads both.":["Em uma grade de agendamento, os horários das reuniões estão vinculados tanto a “Segunda-feira” quanto a “Sala de conferência A”, para que a tecnologia assistiva leia ambos."],"In a large table, data cells aren’t properly connected to their headers, making it hard for screen reader users to understand what each number means.":["Em uma tabela grande, as células de dados não estão conectadas adequadamente aos seus cabeçalhos, o que dificulta que os usuários de leitores de tela entendam o significado de cada número."],"For tables where one cell relates to several row or column headers, tag each data cell to all the headings it belongs to.":["Nas tabelas em que uma célula está relacionada a vários cabeçalhos de linhas ou colunas, marque cada célula de dados com todos os títulos aos quais ela pertence."],"If headers and data aren’t clearly linked in complex tables, people relying on assistive technologies can get lost or misunderstand the information.":["Se os cabeçalhos e os dados não estiverem claramente vinculados em tabelas complexas, as pessoas que dependem de tecnologias assistivas podem se perder ou não entender as informações."],"Complex tables must link headers and data clearly.":["As tabelas complexas precisam vincular claramente os cabeçalhos e os dados."],"Complex Table Headers Missing":["Cabeçalhos de tabelas complexas ausentes"],"A sales-data table adds a bold header row “Product | Units Sold | Revenue” so every column is clearly labeled.":["Uma tabela de dados de vendas adiciona uma linha de cabeçalho em negrito “Produto | Unidades vendidas | Receita” para que cada coluna seja claramente identificada."],"A two-column design built with a table is redone using side-by-side layout blocks.":["Um design com duas colunas criado com uma tabela foi refeito usando blocos de layout lado a lado."],"A table lists information but doesn’t mark which cells are headers, making it confusing for screen reader users to understand the data.":["Uma tabela lista informações, mas não marca quais células são cabeçalhos, o que dificulta que os usuários de leitores de tela entendam os dados."],"If you’re using a table only for page layout, switch to a layout block if it’s real data, add clear header rows or columns.":["Se você estiver usando uma tabela apenas para o layout da página, mude para um bloco de layout. Se forem dados reais, adicione linhas ou colunas de cabeçalho claras."],"If tables don’t identify their headers, people relying on assistive technologies may not know how to read and understand the information correctly.":["Se as tabelas não identificarem seus cabeçalhos, as pessoas que dependem de tecnologias assistivas podem não saber como ler e entender as informações corretamente."],"Data tables must clearly identify headers.":["As tabelas de dados precisam identificar claramente os cabeçalhos."],"Missing Table Headers":["Cabeçalhos da tabela ausentes"],"For a report table, mark the left column as “Category” and the top row as “Quarter” without adding extra header markers elsewhere.":["Para uma tabela de relatório, marque a coluna da esquerda como “Categoria” e a linha superior como “Trimestre”, sem adicionar marcadores de cabeçalho adicionais em outro lugar."],"A contact list table with names down the side and phone numbers across the top removes unnecessary “Header” markings on every cell—keeps only “Name” (column) and “Phone” (row) labels.":["Uma tabela de lista de contatos com nomes na lateral e números de telefone na parte superior, remove marcações desnecessárias de “Cabeçalho” em cada célula, mantendo apenas os rótulos “Nome” (coluna) e “Telefone” (linha)."],"A table header uses an invalid value for its scope, making it unclear to screen reader users how the table is organized.":["Um cabeçalho de tabela usa um valor inválido para o escopo, o que dificulta a compreensão dos usuários de leitores de tela sobre a organização da tabela."],"Don’t add extra header labels if your table only has a first row or first column use simple settings to mark those instead.":["Não adicione rótulos de cabeçalho adicionais, se sua tabela tiver apenas a primeira linha ou a primeira coluna. Em vez disso, use configurações simples para marcar esses rótulos."],"If table headers aren’t set up correctly, assistive technologies may not be able to explain the table structure properly, making it harder for people to understand the information.":["Se os cabeçalhos da tabela não estiverem configurados corretamente, as tecnologias assistivas talvez não consigam explicar a estrutura da tabela adequadamente, dificultando a compreensão das informações."],"Use the correct values for table header settings.":["Use os valores corretos para as configurações do cabeçalho da tabela."],"Invalid Table Scope Values":["Valores do escopo da tabela inválidos"],"A student-grades chart ensures each score cell is tied to “Alice” in the first column and “Math” in the header row.":["Um gráfico de notas de alunos garante que cada célula de pontuação esteja vinculada a “Alice” na primeira coluna e a “Matemática” na linha do cabeçalho."],"In a price comparison table, each price cell is tagged to both the product name at the top and the feature name on the left.":["Em uma tabela de comparação de preços, cada célula de preço é marcada com o nome do produto na parte superior e com o nome do recurso à esquerda."],"A data cell points to a header that doesn’t exist in the table, making it confusing for screen reader users to understand the information.":["Uma célula de dados aponta para um cabeçalho que não existe na tabela, o que torna confuso para os usuários de leitores de tela entenderem as informações."],"Make sure every cell in a data table clearly points to the right column and row headings, so screen readers announce them together.":["Certifique-se de que cada célula em uma tabela de dados, aponte claramente para os títulos de coluna e linha corretos, para que os leitores de tela os anunciem juntos."],"If table headers aren’t properly linked, people relying on assistive technologies may not understand the relationship between the data and its meaning, leading to confusion.":["Se os cabeçalhos das tabelas não estiverem vinculados corretamente, as pessoas que dependem de tecnologias assistivas podem não entender a relação entre os dados e seu significado, causando confusão."],"Table headers must correctly link to their cells.":["Os cabeçalhos da tabela precisam ser vinculados corretamente às suas células."],"Invalid Table Header Link":["Link do cabeçalho da tabela inválido"],"A marquee of customer logos includes an “Animation off” setting so viewers can read at their own pace.":["Um carrossel com logos de clientes inclui uma configuração de “Animação desativada” para que os visitantes possam ler no seu próprio ritmo."],"Replace an endlessly scrolling news ticker with a static list of headlines and an optional “Start scrolling” button for those who want the effect.":["Substitua um marcador de notícias com rolagem infinita, por uma lista estática de manchetes e um botão opcional “Iniciar rolagem” para aqueles que querem o efeito."],"A message scrolls across the screen using outdated code, making it hard for users to read or interact with the page.":["Uma mensagem rola pela tela usando um código desatualizado, dificultando a leitura ou a interação dos usuários com a página."],"Scrolling text can be distracting and is not supported by modern accessibility standards, making the site harder to use for many people.":["A rolagem de texto pode causar distração e não é compatível com os padrões modernos de acessibilidade, tornando o site mais difícil de usar para muitas pessoas."],"Don’t use scrolling text (marquee).":["Não use rolagem de texto (marquee)."],"Remove automatic marquee effects or give people a simple toggle to stop or turn off the motion.":["Remova os efeitos automáticos de marquee (rolagem) ou ofereça às pessoas um simples botão de alternância para interromper ou desativar o movimento."],"Scrolling Text Used":["Rolagem de texto usada"],"A promotional carousel offers a “View static version” link so users who find movement distracting can switch to a still layout.":["Um carrossel promocional oferece um link “Ver versão estática” para que os usuários que consideram o movimento uma distração, possam mudar para um layout estático."],"A warning banner that flashes indefinitely is replaced with one that stops blinking after 3 seconds and includes a “Pause animation” button.":["Um banner de alerta que pisca indefinidamente é substituído por um que para de piscar após 3 segundos e inclui um botão “Pausar animação”."],"An ad banner keeps blinking without stopping, distracting users and potentially triggering seizures for people with certain conditions.":["Um banner de anúncio fica piscando sem parar, distraindo os usuários e podendo provocar convulsões em pessoas com determinadas condições."],"Make any flashing or blinking element stop on its own within a few seconds or let people pause or view a non-blinking version.":["Faça com que qualquer elemento que pisque pare sozinho em alguns segundos ou permita que as pessoas pausem ou vejam uma versão sem piscar."],"Persistent blinking can be distracting, overwhelming, or even dangerous for some people, making the website less safe and harder to use.":["O piscar persistente pode distrair, incomodar ou até mesmo ser perigoso para algumas pessoas, tornando o site menos seguro e mais difícil de usar."],"Avoid using content that blinks repeatedly.":["Evite usar conteúdo que pisque repetidamente."],"Persistent Blinking Content":["Conteúdo que pisca persistentemente"],"If a warning page times out, show a “Stay on this page” button and a countdown so users aren’t surprised.":["Se uma página de alerta expirar, mostre um botão “Permanecer nesta página” e uma contagem regressiva, para que os usuários não sejam surpreendidos."],"Your dashboard refreshes every minute—add a toggle so people can turn off auto-update if they need time to read.":["Seu painel é atualizado a cada minuto, adicione um botão de alternância para que as pessoas possam desativar a atualização automática se precisarem de tempo para ler."],"A page refreshes after a few minutes without telling the user, causing someone to lose information they were entering.":["Uma página é atualizada após alguns minutos sem avisar o usuário, fazendo com que ele perca as informações que estava inserindo."],"Don’t force the page to reload on a timer either remove the automatic refresh or let visitors pause or extend it.":["Não force a página a recarregar em um tempo determinado. Remova a atualização automática ou permita que os visitantes a pausem ou estendam."],"If a page refreshes without warning, people — especially those with disabilities — might lose their place, miss important information, or have trouble completing tasks.":["Se uma página for atualizada sem nenhum alerta, as pessoas, especialmente as portadoras de deficiência, podem perder o lugar, perder informações importantes ou ter problemas para concluir tarefas."],"Pages should not refresh automatically without a warning or option.":["As páginas não podem ser atualizadas automaticamente sem nenhum alerta ou opção."],"Auto Refresh Without Warning":["Atualização automática sem alerta"],"If a section flips upside down on mobile, switch to a flexible layout option that adapts to both orientations.":["Se uma seção virar de cabeça para baixo nos dispositivos móveis, mude para uma opção de layout flexível, que se adapte a ambas as orientações."],"You added a rotate effect that only shows correctly in portrait—remove that so the page also works in landscape.":["Você adicionou um efeito de rotação que só é exibido corretamente no modo retrato. Remova-o para que a página também funcione no modo paisagem."],"A form forces users to turn their device sideways to fill it out, making it difficult for people who can’t easily rotate their screens.":["Um formulário força os usuários a virar o dispositivo de lado para preenchê-lo, o que dificulta para as pessoas que não conseguem girar suas telas facilmente."],"Avoid locking parts of your page into portrait or landscape use responsive settings so content rotates naturally.":["Evite bloquear partes da sua página em retrato ou paisagem. Use configurações responsivas, para que o conteúdo gire naturalmente."]}},"comment":{"reference":"modules\/scanner\/assets\/js\/constants\/ux-messaging.js"}}